In [1]:
import pandas as pd

In [2]:
person = pd.read_csv('Person.csv', sep=',')
city = pd.read_csv('City.csv')

In [3]:
person.iloc[0]

name                 Leo
age                   18
country    United States
patient                1
Name: 0, dtype: object

In [4]:
person.name

0        Leo
1      Diana
2     Shango
3    Jessica
Name: name, dtype: object

In [5]:
person['adult'] = (person.age >= 18)
person['adult_patient'] = (person.age >= 18) & person.patient
person['united_patient'] = person.apply(lambda row: row['adult'] and row['country'].startswith('United'), axis=1)
person

      name  age         country  patient  adult  adult_patient  united_patient
0      Leo   18   United States        1   True           True            True
1    Diana    7   United States        1  False          False           False
2   Shango    9  United Kingdom        0  False          False           False
3  Jessica   25           China        0   True          False           False

In [10]:
#SELECT * FROM person LIMIT 2

person.head(2)

    name  age        country  patient  adult  adult_patient  united_patient
0    Leo   18  United States        1   True           True            True
1  Diana    7  United States        1  False          False           False

In [11]:
#SELECT * FROM Person WHERE age < 10
    
person[person.age < 10]

     name  age         country  patient  adult  adult_patient  united_patient
1   Diana    7   United States        1  False          False           False
2  Shango    9  United Kingdom        0  False          False           False

In [12]:
#SELECT COUNT(name) FROM Person GROUP BY country
    
person.groupby('country')['name'].count()

country
China             1
United Kingdom    1
United States     2
Name: name, dtype: int64

In [13]:
#SELECT COUNT(name) FROM Person GROUP BY country

person.groupby('country')['name'].count()

country
China             1
United Kingdom    1
United States     2
Name: name, dtype: int64

In [15]:
# SELECT COUNT(name), AVG(age), SUM(patient) FROM Person GROUP BY country
import numpy as np
person.groupby('country').agg({'name':np.size, 'age':np.mean, 'patient': np.sum})

                name   age  patient
country
China              1  25.0        0
United Kingdom     1   9.0        0
United States      2  12.5        2

In [16]:
# SELECT Person.*, City.city FROM Person JOIN City on Person.name = City.name
    
pd.merge(person, city, on='name')

,name,age,country,patient,adult,adult_patient,united_patient,city
0,Leo,18,United States,1,True,True,True,Boston
1,Diana,7,United States,1,False,False,False,Chicago
2,Jessica,25,China,0,True,False,False,Shanghai

In [17]:
#USE example
import sqlite3
conn = sqlite3.connect('example.db')
cursor = conn.cursor()

In [19]:
#CREATE TABLE Scores (student TEXT, gpa INT)

cursor.execute('''CREATE TABLE Score (student TEXT, gpa INT)''')

In [20]:
#INSERT INTO Scores VALUES ('Alice', 100)

cursor.execute('''INSERT INTO Score VALUES ('Alice', 100)''')

In [25]:
# INSERT INTO Scores VALUES ('Bob', 90)

cursor.execute('''INSERT INTO Score VALUES ('Bob', 90)''')

In [29]:
# SELECT * FROM Scores WHERE gpa > 85

cursor.execute('''SELECT * FROM Score WHERE gpa > 85''')
cursor.fetchall()

[('Alice', 100), ('Bob', 90)]

In [28]:
#SELECT * FROM Scores LIMIT 1

cursor.execute('''SELECT * FROM Scores''')
curs.

[('Alice', 100), ('Bob', 90)]